## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 7 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.forms_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_s3"  {
      ~ id      = "1529996084" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::forms-staging-reliability-file-storage/*",
                          - "arn:aws:s3:::forms-staging-reliability-file-storage",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.forms_secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_secrets_manager"  {
      ~ id      = "3949306306" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:token_secret-UyxxRR",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:recaptcha_secret-spUZxB",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
                # (6 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.lambda_app_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_app_invoke"  {
      ~ id      = "1836777753" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Templates",
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Submission",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.lambda_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_s3"  {
      ~ id      = "1995346246" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::forms-staging-vault-file-storage/*",
                          - "arn:aws:s3:::forms-staging-vault-file-storage",
                          - "arn:aws:s3:::forms-staging-reliability-file-storage/*",
                          - "arn:aws:s3:::forms-staging-reliability-file-storage",
                          - "arn:aws:s3:::forms-staging-archive-storage/*",
                          - "arn:aws:s3:::forms-staging-archive-storage",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      ~ id       = "9cff67eaea9e9aa606ce5b83f033e248ce637982bffcaf00f59cc11be48f48f9" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "ORGANIZATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organizations"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-staging-reliability-file-storage"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_RECAPTCHA_V3_SITE_KEY"
                          - value = "6LfJDN4eAAAAAGvdRF7ZnQ7ciqdo1RQnQDFmh0VY"
                        },
                    ]
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "RECAPTACHA_V3_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:recaptcha_secret-spUZxB"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                      - {
                          - name      = "TOKEN_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:token_secret-UyxxRR"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                  ~ secrets          = [
                        # (5 unchanged elements hidden)
                        {
                            name      = "TOKEN_SECRET"
                            valueFrom = "${token_secret}"
                        },
                      + {
                          + name      = "GC_NOTIFY_CALLBACK_BEARER_TOKEN"
                          + valueFrom = "${gc_notify_callback_bearer_token}"
                        },
                    ]
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          + "gc_notify_callback_bearer_token" = (known after apply)
            # (19 unchanged elements hidden)
        }
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-viewer:371" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_RECAPTCHA_V3_SITE_KEY"
                          - value = "6LfJDN4eAAAAAGvdRF7ZnQ7ciqdo1RQnQDFmh0VY"
                        },
                      - {
                          - name  = "ORGANIZATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organizations"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-staging-reliability-file-storage"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "RECAPTACHA_V3_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:recaptcha_secret-spUZxB"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                      - {
                          - name      = "TOKEN_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:token_secret-UyxxRR"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 371 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_s3 will be updated in-place
  ~ resource "aws_iam_policy" "forms_s3" {
        id        = "arn:aws:iam::687401027353:policy/formsS3Access"
        name      = "formsS3Access"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::forms-staging-reliability-file-storage/*",
                          - "arn:aws:s3:::forms-staging-reliability-file-storage",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "forms_secrets_manager" {
        id        = "arn:aws:iam::687401027353:policy/formsSecretsManagerKeyRetrieval"
        name      = "formsSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:token_secret-UyxxRR",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:recaptcha_secret-spUZxB",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK",
                          - "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_sqs will be created
  + resource "aws_iam_policy" "forms_sqs" {
      + arn         = (known after apply)
      + description = "IAM policy to allow access to SQS for Forms ECS task"
      + id          = (known after apply)
      + name        = "forms_sqs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:GetQueueUrl",
                        ]
                      + Effect   = "Allow"
                      + Resource = ""
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_app_invoke will be updated in-place
  ~ resource "aws_iam_policy" "lambda_app_invoke" {
        id          = "arn:aws:iam::687401027353:policy/lambda_app_invoke"
        name        = "lambda_app_invoke"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Templates",
                          - "arn:aws:lambda:ca-central-1:687401027353:function:Submission",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id          = "arn:aws:iam::687401027353:policy/lambda_s3"
        name        = "lambda_s3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:DeleteObject",
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::forms-staging-reliability-file-storage",
                          - "arn:aws:s3:::forms-staging-reliability-file-storage/*",
                          - "arn:aws:s3:::forms-staging-vault-file-storage",
                          - "arn:aws:s3:::forms-staging-vault-file-storage/*",
                          - "arn:aws:s3:::forms-staging-archive-storage",
                          - "arn:aws:s3:::forms-staging-archive-storage/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.sqs_forms will be created
  + resource "aws_iam_role_policy_attachment" "sqs_forms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "form-viewer"
    }

  # aws_lambda_event_source_mapping.reprocess_submission will be created
  + resource "aws_lambda_event_source_mapping" "reprocess_submission" {
      + batch_size                    = 1
      + enabled                       = true
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:65",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:73",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2022-03-02T21:23:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "RIxQbTwrxUzKugkChb1FlVs4C6kSmSIMywW69xe7io4=" -> "z5hci8yBwuwi9wP2smudPACtWuBR1eUB+7WPhpwSOXw="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:65" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-03-02T21:23:06.708+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:65" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "s3LCXB4zLXdTmGLEglxwEIYtkcWqv3VNomWJm+f3bJY=" -> "18ImLkcuxJBl9EzjLIY0HkTpuMviRotDb+ve6c8/fAQ=" # forces replacement
      ~ source_code_size            = 6100 -> (known after apply)
      ~ version                     = "65" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:73" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-03-02T21:23:10.053+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:73" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "RNRLmg2w404cSUrlkuRS2chby3yX9ZU/tCu8LrZBazA=" -> "i800xJ5ILFSV7OahY6EH1BzeAENivPhKHdr7frgyYPU=" # forces replacement
      ~ source_code_size            = 4814032 -> (known after apply)
      ~ version                     = "73" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.reliability_file_storage will be updated in-place
  ~ resource "aws_s3_bucket" "reliability_file_storage" {
        id                          = "forms-staging-reliability-file-storage"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "tf-s3-lifecycle-20210817191835262200000002"
            tags                                   = {}
            # (2 unchanged attributes hidden)

          ~ expiration {
              ~ days                         = 5 -> 2
                # (1 unchanged attribute hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.gc_notify_callback_bearer_token will be created
  + resource "aws_secretsmanager_secret" "gc_notify_callback_bearer_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "gc_notify_callback_bearer_token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.gc_notify_callback_bearer_token will be created
  + resource "aws_secretsmanager_secret_version" "gc_notify_callback_bearer_token" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 8 to add, 7 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

16 tests, 16 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
